Catalogs/ПравилаОбменаСПодключаемымОборудованиемOffline.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ПравилаОбменаСПодключаемымОборудованиемOffline</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПодключаемогоОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключаемогоОборудования</v8:Type>
						<v8:Type>cfg:EnumRef.ТипыОфлайнОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияВеса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксВесовогоТовара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОплатуПлатежнымиКартами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСкидкиНаценки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьГруппыТоваров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйКодPLU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвояНумерацияPLUНаОборудовании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоМППроверкаЦенников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/КодыТоваровPLUНаОборудовании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>КодыТоваровPLUНаОборудовании</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодТовараSKU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПравилоОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбменаСПодключаемымОборудованиемOffline</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодТовараPLU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КодыТоваровSKU.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>КодыТоваровSKU</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихкода</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЧеков</Name>
					<Comment>ReceiptPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
					<Comment>DataCollectionTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Comment>AcquiringTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеВесы</Name>
					<Comment>Scale</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесыСПечатьюЭтикеток</Name>
					<Comment>ScaleOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЭтикеток</Name>
					<Comment>LabelPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьККМОфлайн</Name>
					<Comment>ECROffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFID</Name>
					<Comment>RFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстройствоРаспознавания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОблачнаяККТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Несертифицируемое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыОфлайнОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыОфлайнОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрайсЧекер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОФД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПравилаОбменаСПодключаемымОборудованиемOffline/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ОтветПередЗаписью;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЭтоМППроверкаЦенников") И Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ЭтоМППроверкаЦенников = Истина;
	КонецЕсли;
	
	ВерхняяГраницаДиапазонаSKUВесовогоТовара = Константы.ВерхняяГраницаДиапазонаSKUВесовогоТовара.Получить();
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов.
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма); 
	Элементы.НастройкаPLU.Видимость       = Объект.ТипПодключаемогоОборудования = Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток;
	Элементы.МаксимальныйКодPLU.Доступность = Объект.СвояНумерацияPLUНаОборудовании;
	Элементы.ТоварыPLU.Видимость          = Элементы.НастройкаPLU.Видимость;
	
	Настроить();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ПодменюПечать);  
	
	Элементы.ТипПодключаемогоОборудования.СписокВыбора.Вставить(0, Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток, НСтр("ru = 'Весы с печатью этикеток'"));
	Элементы.ТипПодключаемогоОборудования.СписокВыбора.Вставить(1, Перечисления.ТипыОфлайнОборудования.ККМ, НСтр("ru = 'ККМ Офлайн'"));
	
	Элементы.ТабДок.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	Элементы.ТабДок.ОтображениеСостояния.Текст = НСтр("ru = 'Данные не рассчитаны. Нажмите ""Обновить"" для заполнения таблицы.'");
	Элементы.ТабДок.ОтображениеСостояния.Видимость = Истина;
	
	Элементы.ТоварыХарактеристика.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	Элементы.ТоварыПартия.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьПартии");
	Элементы.ТоварыЕдиницаИзмерения.Видимость = ПолучитьФункциональнуюОпцию("УчетВРазличныхЕдиницахИзмерения");
	
	ЗаполнитьФормуЕслиЭтоМППроверкаЦенников();
	ПеренастроитьФормуЕслиЭтоМППроверкаЦенников();
	
	// ПодключаемоеОборудование
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	Если ИспользоватьПодключаемоеОборудование Тогда
		ТипыОборудования = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
		ТипыОборудования.СканерШтрихкода = Истина;
		МенеджерОборудования.ПриСозданииНаСервере(ЭтотОбъект, ТипыОборудования);
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.НастройкиКомпоновкиДанных = Новый ХранилищеЗначения(КомпоновщикНастроек.ПолучитьНастройки());
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Настроить();
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов.
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Подсистема запрета редактирования ключевых реквизитов объектов.
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	Оповестить("Запись_ПравилаОбменаСПодключаемымОборудованием", ПараметрыЗаписи, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
	НастроитьДоступностьЭлементовПрайсЛиста();
	
	Если Объект.ЭтоМППроверкаЦенников Тогда
		ПодключитьОбработчикОжидания("ОбновитьСписокНоменклатуры", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
	Если Объект.ЭтоМППроверкаЦенников Тогда
		ОповеститьОВыборе(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриИзменении(Элемент)
	
	ДанныеАктуальны = Ложь;
	
	НастроитьДоступностьЭлементовПрайсЛиста();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПодключаемогоОборудованияПриИзменении(Элемент)
	Настроить();
	Элементы.НастройкаPLU.Видимость = Объект.ТипПодключаемогоОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток");
	Элементы.ТоварыPLU.Видимость = Элементы.НастройкаPLU.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ТипПодключаемогоОборудованияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	Настроить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьГруппыТоваровПриИзменении(Элемент)
	
	ДанныеАктуальны = Ложь;
	
	НастроитьДоступностьЭлементовПрайсЛиста();
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктурнаяЕдиницаПриИзменении(Элемент)
	
	Если Объект.ЭтоМППроверкаЦенников И ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		НовыйСкладВСтроку = "(" + Строка(Объект.СтруктурнаяЕдиница) + ")";
		Если СтрНайти(Объект.Наименование, ТекущийСкладВСтроку) > 0  Тогда
			Объект.Наименование = СтрЗаменить(Объект.Наименование, ТекущийСкладВСтроку, НовыйСкладВСтроку);
		КонецЕсли;
		ТекущийСкладВСтроку = НовыйСкладВСтроку;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ОбработчикиКомандПодключаемогоОборудования

&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	ТекШтрихкод = "";
	
	ОбработкаЗавершения = Новый ОписаниеОповещения(
		"ПоискПоШтрихкодуЗавершение",
		ЭтотОбъект, 
		Новый Структура("ТекШтрихкод", ТекШтрихкод));
	
	#Если МобильныйКлиент Тогда
		ОткрытьФорму("ОбщаяФорма.ФормаПоискаПоШтрихкоду",,,,,,ОбработкаЗавершения);
	#Иначе
		ПоказатьВводЗначения(ОбработкаЗавершения, ТекШтрихкод, НСтр("ru = 'Введите штрихкод'"));
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекШтрихкод = ?(Результат = Неопределено, СокрЛП(ДополнительныеПараметры.ТекШтрихкод), СокрЛП(Результат));
	
	Если НЕ ПустаяСтрока(ТекШтрихкод) Тогда
		ПолученыШтрихкоды(Новый Структура("Штрихкод, Количество", ТекШтрихкод, 1));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура РаботаСКодамиSKU(Команда)
	ОткрытьФорму("Обработка.РаботаСКодамиТоваровSKU.Форма");
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьSKU(Команда)
	
	ВыгрузкаНаВесы = Объект.ТипПодключаемогоОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток");
	
	Если ВыгрузкаНаВесы Тогда
		ТекстСообщения = НСтр("ru = 'Выполняется генерация SKU и PLU...'");
	Иначе
		ТекстСообщения = НСтр("ru = 'Выполняется генерация SKU...'");
	КонецЕсли;
	Состояние(ТекстСообщения);
	
	
	СоздатьSKUДляТоваровСервер();
	
	Если ВыгрузкаНаВесы Тогда
		ТекстСообщения = НСтр("ru = 'Генерация SKU и PLU завершена.'");
	Иначе
		ТекстСообщения = НСтр("ru = 'Генерация SKU завершена.'");
	КонецЕсли;
	Состояние(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьPLU(Команда)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.SKU) Тогда
			
			ТекстПредупреждения = НСтр("ru = 'Изменение PLU доступно только для позиций с SKU'");
			ПоказатьПредупреждение(, ТекстПредупреждения);
			
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.PLU) Тогда
			
			КлючЗаписи = СоздатьКлючЗаписиРегистра(ТекущиеДанные.PLU);
			ПараметрыФормы.Вставить("Ключ", КлючЗаписи);
			
		Иначе
			
			ПараметрыСозданияPLU = Новый Структура;
			ПараметрыСозданияPLU.Вставить("ПравилоОбмена", Объект.Ссылка);
			ПараметрыСозданияPLU.Вставить("КодSKU", ТекущиеДанные.SKU);
			
			ПараметрыФормы.Вставить("ПараметрыСозданияPLU", ПараметрыСозданияPLU);
			
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИдентификаторСтроки", ТекущиеДанные.ПолучитьИдентификатор());
		ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьPLUЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		ОткрытьФорму("РегистрСведений.КодыТоваровPLUНаОборудовании.Форма.ФормаИзмененияPLU", ПараметрыФормы,,,,,ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьPLU(Команда)
	
	ОчиститьPLUСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьPLUСервер()
	
	Для Каждого ИдентификаторСтроки Из Элементы.Товары.ВыделенныеСтроки Цикл
		
		ВыделеннаяСтрока = Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		Если ЗначениеЗаполнено(ВыделеннаяСтрока.PLU) Тогда
			РегистрыСведений.КодыТоваровPLUНаОборудовании.УдалитьPLU(Объект.Ссылка, ВыделеннаяСтрока.PLU);
			ВыделеннаяСтрока.PLU = 0;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокТоваров(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Модифицированность ИЛИ НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если НЕ Записать() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Состояние(НСтр("ru = 'Выполняется обновление списка товаров...'"));
	
	ОбновитьСписокТоваровНаСервере();
	
	НастроитьДоступностьЭлементовПрайсЛиста();
	
	Состояние(НСтр("ru = 'Обновление списка товаров завершено.'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьНастройкиОтбораПоУмолчанию(Команда)
	
	ДанныеАктуальны = Ложь;
	НастроитьДоступностьЭлементовПрайсЛиста();
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СвояНумерацияPLUНаОборудованииПриИзменении(Элемент)
	Элементы.МаксимальныйКодPLU.Доступность = Объект.СвояНумерацияPLUНаОборудовании;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьОтбор(Команда)
	
	ВидимостьОтбора = НЕ ВидимостьОтбора;
	
	УстановитьВидимостьОтбора(Элементы, ВидимостьОтбора);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПередЗаписьюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда 
		ОтветПередЗаписью = Истина;
		Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьPLUЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Товары.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		ТекущаяСтрока.PLU = Результат.КодТовараPLU;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьКлючЗаписиРегистра(PLU)
	
	Возврат РегистрыСведений.КодыТоваровPLUНаОборудовании.СоздатьКлючЗаписи(Новый Структура("ПравилоОбмена, КодТовараPLU, КодТовараSKU", Объект.Ссылка, PLU));
	
КонецФункции

&НаСервере
Процедура СоздатьSKUДляТоваровСервер()
	
	СоздаватьSKU = Истина; 
	ТаблицаТоваровДляSKU = Товары.Выгрузить();
	
	ИндексТовара = 0;
	КоличествоТоваровВТаблице = 0;
	
	ТаблицаТоваровКСозданию = Новый ТаблицаЗначений();
	ТаблицаТоваровКСозданию.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаТоваровКСозданию.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаТоваровКСозданию.Колонки.Добавить("Группа", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаТоваровКСозданию.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	ТаблицаТоваровКСозданию.Колонки.Добавить("SKU", Новый ОписаниеТипов("Число"));
	ТаблицаТоваровКСозданию.Колонки.Добавить("PLU", Новый ОписаниеТипов("Число"));
	ТаблицаТоваровКСозданию.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	ТаблицаТоваровКСозданию.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Число"));
	ТаблицаТоваровКСозданию.Колонки.Добавить("Весовой", Новый ОписаниеТипов("Булево"));
	ТаблицаТоваровКСозданию.Колонки.Добавить("ИндексПиктограммы", Новый ОписаниеТипов("Число"));
	ТаблицаТоваровКСозданию.Колонки.Добавить("ЭтоГруппа", Новый ОписаниеТипов("Булево"));
	ТаблицаТоваровКСозданию.Колонки.Добавить("Партия", Новый ОписаниеТипов("СправочникСсылка.ПартииНоменклатуры"));
	ТаблицаТоваровКСозданию.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
	
	Для Каждого Товар Из ТаблицаТоваровДляSKU Цикл
		
		НоваяСтрокаТовара = ТаблицаТоваровКСозданию.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТовара, Товар);
		КоличествоТоваровВТаблице = КоличествоТоваровВТаблице + 1;
		ИндексТовара = ИндексТовара + 1;
		
		Если КоличествоТоваровВТаблице = 100 ИЛИ ИндексТовара = ТаблицаТоваровДляSKU.Количество() Тогда
			КоличествоТоваровВТаблице = 0;
			РегистрыСведений.КодыТоваровSKU.ОбновитьКоды_SKU_PLU(ТаблицаТоваровКСозданию, СоздаватьSKU, Объект.Ссылка,, Ложь);
			ТаблицаТоваровКСозданию.Очистить();
		КонецЕсли;
		
	КонецЦикла;
	
	РегистрыСведений.КодыТоваровSKU.УдалитьНеиспользуемыеКодыТоваровPLUНаОборудовании(ТаблицаТоваровДляSKU, Объект.Ссылка);
	
	ОбновитьСписокТоваровНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступностьЭлементовПрайсЛиста()
	
	Если ДанныеАктуальны Тогда
		
		Элементы.СтраницыВПрайсЛисте.ТекущаяСтраница = Элементы.СтраницаСписокТоваров;
		
	Иначе
		
		Элементы.СтраницыВПрайсЛисте.ТекущаяСтраница = Элементы.СтраницаОтборИзменен;
	КонецЕсли;
	
	Элементы.СгенерироватьSKU.Доступность    = ДанныеАктуальны;
	Элементы.ИзменитьPLU.Доступность         = ДанныеАктуальны;
	Элементы.ОчиститьPLU.Доступность         = ДанныеАктуальны;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокТоваровНаСервере()
	
	Товары.Очистить();
	
	ТаблицаТоваров = Справочники.ПравилаОбменаСПодключаемымОборудованиемOffline.СписокТоваровПоПравилу(Объект.Ссылка);
	
	Если НЕ ТаблицаТоваров = Неопределено Тогда
		Товары.Загрузить(ТаблицаТоваров);
	КонецЕсли;
	
	ДанныеАктуальны = Истина;
	
КонецПроцедуры

&НаСервере
Процедура Настроить()
	
	СхемаКомпоновкиДанных = Справочники.ПравилаОбменаСПодключаемымОборудованиемOffline.ПолучитьМакет("ОбновлениеКодовSKU");
	
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПравилаОбменаСПодключаемымОборудованием.НастройкиКомпоновкиДанных КАК НастройкиКомпоновкиДанных
		|ИЗ
		|	Справочник.ПравилаОбменаСПодключаемымОборудованиемOffline КАК ПравилаОбменаСПодключаемымОборудованием
		|ГДЕ
		|	ПравилаОбменаСПодключаемымОборудованием.Ссылка = &ПравилоОбмена");
		
		Запрос.УстановитьПараметр("ПравилоОбмена", Объект.Ссылка);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			НастройкиКомпоновкиДанных = Выборка.НастройкиКомпоновкиДанных.Получить();
			Если ЗначениеЗаполнено(НастройкиКомпоновкиДанных) Тогда
				КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
			Иначе
				КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КонецЕсли;
	
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	Если Объект.ТипПодключаемогоОборудования = Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток Тогда
		
		Элементы.ГруппаВыгружатьГруппыТоваров.Видимость = Ложь;
		Элементы.ТоварыPLU.Видимость = Истина;
		Элементы.ИзменитьPLU.Видимость = Истина;
		Элементы.ОчиститьPLU.Видимость = Истина;
		
		Элементы.СгенерироватьSKU.Заголовок = НСтр("ru = 'Сгенерировать SKU, PLU'");
	Иначе
		Элементы.ГруппаВыгружатьГруппыТоваров.Видимость = Истина;
		Элементы.ТоварыPLU.Видимость = Ложь;
		Элементы.ИзменитьPLU.Видимость = Ложь;
		Элементы.ОчиститьPLU.Видимость = Ложь;
		
		Элементы.СгенерироватьSKU.Заголовок = НСтр("ru = 'Сгенерировать SKU'");
	КонецЕсли;
	
	СкладОрганизация = Объект.Организация;
	СкладОрганизацияИНН = Объект.Организация.ИНН;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ПолученыШтрихкоды(ДанныеШтрихкодов) Экспорт
	
	//Модифицированность = Истина;
	//
	//НедобавленныеШтрихкоды		= ЗаполнитьПоДаннымШтрихкодов(ДанныеШтрихкодов);
	//НеизвестныеШтрихкоды		= НедобавленныеШтрихкоды.НеизвестныеШтрихкоды;
	//ШтрихкодыНекорректногоТипа	= НедобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;
	//
	//ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	//
	//
	//Если НеизвестныеШтрихкоды.Количество() > 0 Тогда
	//	
	//	Оповещение = Новый ОписаниеОповещения("ПолученыШтрихкодыЗавершение", ЭтотОбъект, НеизвестныеШтрихкоды);
	//	
	//	ОткрытьФорму(
	//		"РегистрСведений.ШтрихкодыНоменклатуры.Форма.РегистрацияШтрихкодовНоменклатуры",
	//		Новый Структура("НеизвестныеШтрихкоды", НеизвестныеШтрихкоды), ЭтотОбъект,,,,Оповещение
	//	);
	//	
	//	Возврат;
	//	
	//КонецЕсли;
	//
	//ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыЗавершение(ВозвращаемыеПараметры, Параметры) Экспорт
	
	//НеизвестныеШтрихкоды = Параметры;
	//
	//Если ВозвращаемыеПараметры <> Неопределено Тогда
	//	
	//	МассивШтрихкодов = Новый Массив;
	//	
	//	Для каждого ЭлементМассива Из ВозвращаемыеПараметры.ЗарегистрированныеШтрихкоды Цикл
	//		МассивШтрихкодов.Добавить(ЭлементМассива);
	//	КонецЦикла;
	//	
	//	Для каждого ЭлементМассива Из ВозвращаемыеПараметры.ПолученыНовыеШтрихкоды Цикл
	//		МассивШтрихкодов.Добавить(ЭлементМассива);
	//	КонецЦикла;
	//	
	//	НедобавленныеШтрихкоды		= ЗаполнитьПоДаннымШтрихкодов(МассивШтрихкодов);
	//	НеизвестныеШтрихкоды		= НедобавленныеШтрихкоды.НеизвестныеШтрихкоды;
	//	ШтрихкодыНекорректногоТипа	= НедобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;
	//	ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	//КонецЕсли;
	//
	//ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды) Экспорт
	
	Для Каждого ТекНеизвестныйШтрихкод Из НеизвестныеШтрихкоды Цикл
		
		СтрокаСообщения = НСтр("ru = 'Данные по штрихкоду не найдены: %1%; количество: %2%'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНеизвестныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНеизвестныйШтрихкод.Количество);
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа) Экспорт
	
	Для Каждого ТекНекорректныйШтрихкод Из ШтрихкодыНекорректногоТипа Цикл
		
		СтрокаСообщения = НСтр("ru = 'Найденная по штрихкоду %1% номенклатура -%2%- имеет тип %3%, который не подходит для этой табличной части'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНекорректныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНекорректныйШтрихкод.Номенклатура);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%3%", ТекНекорректныйШтрихкод.ТипНоменклатуры);
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПеренастроитьФормуЕслиЭтоМППроверкаЦенников()

	Если Не Объект.ЭтоМППроверкаЦенников Тогда
		Возврат
	КонецЕсли;
	
	Элементы.ТипПодключаемогоОборудования.Видимость = Ложь;
	Элементы.ГруппаВыгружатьГруппыТоваров.Видимость = Ложь;
	
	ЭтаФорма.АвтоЗаголовок = Ложь;
	ЭтаФорма.Заголовок = НСтр("ru = 'Правило обмена с мобильным приложением 1С:Проверка ценников'");
	
	ТекущийСкладВСтроку = "(" + Строка(Объект.СтруктурнаяЕдиница) + ")";
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуЕслиЭтоМППроверкаЦенников()

	Если Не Объект.ЭтоМППроверкаЦенников Или ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат
	КонецЕсли;
	
	Объект.ТипПодключаемогоОборудования = Перечисления.ТипыПодключаемогоОборудования.УдалитьККМОфлайн;
	
	//Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	Объект.СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ОсновнойСклад();
	
	ШаблонНаименования = НСтр("ru = '1С:Проверка ценников (%1)'");
	Объект.Наименование = СтрШаблон(ШаблонНаименования, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СтруктурнаяЕдиница, "Наименование"));
	
	//Объект.ВидЦеныНоменклатуры = Справочники.ВидыЦен.ПолучитьОсновнойВидЦенПродажи();

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьОтбора(Знач Элементы, Знач ВидимостьОтбора)
	
	Если ВидимостьОтбора Тогда
		Элементы.Отбор.Видимость = Истина;
		Элементы.ТоварыПоказатьСкрытьОтбор.Заголовок = НСтр("ru = 'Скрыть отбор'");
	Иначе
		Элементы.Отбор.Видимость = Ложь;
		Элементы.ТоварыПоказатьСкрытьОтбор.Заголовок = НСтр("ru = 'Показать отбор'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокНоменклатуры()

	ОбновитьСписокТоваров(Неопределено);

КонецПроцедуры

#КонецОбласти
